{"keras_version": "2.0.5", "config": [{"config": {"dtype": "float32", "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_3", "bias_constraint": null, "use_bias": true, "padding": "valid", "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 10, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_4", "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}